---
title: "程序内购买"
layout: post
category: apple
---



什么是IAP（In App Purchase）？大白话就是程序内购买。
前不久iPhone上的内购被一名俄罗斯黑客破解了，现在Mac上的也被破解了，而且居然是以同样的方式...这类新闻网上多的是，也就不细讲了。
下面切入正题：

注意：如果您使用的是山狮（10.8），需要在”设置“—”安全与隐私“—启用”任何来源“


首先，将这三个必须的文件下载下来：点我下载

依次安装两个证书（注意：先安装第一个，在安装第二个）


将”Grim_Receiper.dmg“中的两个文件复制到一个安全的地方（我只复制到了应用程序文件夹）

点击设置—网络—“高级”—DNS—点击“+”
填写第一个IP
94.228.221.10
再点击”+“
填写另外一个IP
91.224.160.136
点击”好“—应用



好了，设置就完成了。
现在要做的就是打开应用程序，购买，完成

运行”Grim Receiper“，点击"Just let me do smth"，把要内购的程序拖到里面，程序就自动蹦了出来。

教程至此为止！


"10.8-inAppPurchase":http://115.com/file/betxpwg3